{"title":"Modelling people's names (is hard)","slug":"modelling-people-s-names-is-hard","published":"2016-04-29","version":1,"html":"<h1>Modelling people's names (is hard)<\/h1>\n<p>Everyone has a name... or multiple names. What we are called (usually) depends on the environment we are in. I myself use a nickname at work (Kudłaty, or Shaggy in English -- I hope you watched Scooby Doo), another nickname on the internet and (most of) my personal life. I also use my legal name in some contexts (e.g. for tax and another official purposes). Most of the people that I know from the internet use a nickname (have you ever seen anyone using their legal name on IRC, or a discussion forum?). All of this stuff, that is easy for humans to grasp is (as always) very compliacted to model in computers.<\/p>\n<p>Let's start with a very simple model:<\/p>\n<pre><code class=\"language-csharp\">\tclass PersonalName\n\t{\n\t\tpublic string Firstname { get; set; }\n\t\tpublic string Surname { get; set; }\n\t}\n<\/code><\/pre>\n<p>Seems reasonable, right? Well, it is not... What about the Japanese emperor -- Akihito (yup, that's his whole name)? Our model covers some cases of western names, but isn't really exhaustive.<\/p>\n<p>So, next model:<\/p>\n<pre><code class=\"language-csharp\">\tinterface IPersonalName\n\t{\n\t\tpublic string DisplayName { get; }\n\t}\n\t\n\tclass PolynymousName : IPersonalName\n\t{\n\t\tpublic string Firstname { get; set; }\n\t\tpublic string Surname { get; set; }\n\t\t\n\t\tpublic string DisplayName\n\t\t{\n\t\t\tget { return string.Format(&quot;{0} {1}&quot;, Firstname, Surname); }\n\t\t}\n\t}\n\t\n\tclass MononymousName : IPersonalName\n\t{\n\t\tpublic string DisplayName { get; set; }\n\t}\n<\/code><\/pre>\n<p>But we have uncounsiously introduced an assumption that first name always precedes the last name. This is not true, for example in China.\nLet's try again<\/p>\n<pre><code class=\"language-csharp\">\tinterface IPersonalName\n\t{\n\t}\n\t\n\tclass PolynymousName : IPersonalName\n\t{\n\t\tpublic string Firstname { get; set; }\n\t\tpublic string Surname { get; set; }\n\t}\n\t\n\tclass MononymousName : IPersonalName\n\t{\n\t\tpublic string Name { get; set; }\n\t}\n\n\tinterface IPersonalNameFormatter&lt;T&gt; where T : IPersonalName\n\t{\n\t\tpublic string Format(T name);\n\t}\n\t\n\tclass WesternNameFormatter : IPersonalNameFormatter&lt;PolynymousName&gt;\n\t{\n\t\tpublic string Format(PolynymousName name)\n\t\t{\n\t\t\treturn string.Format(&quot;{0} {1}&quot;, name.Firstname, name.Surname);\n\t\t}\n\t}\n\t\n\tclass ChineseNameFormatter : IPersonalNameFormatter&lt;PolynymousName&gt;\n\t{\n\t\tpublic string Format(PolynymousName name)\n\t\t{\n\t\t\treturn string.Format(&quot;{0} {1}&quot;, name.Surname, name.Firstname);\n\t\t}\n\t}\n<\/code><\/pre>\n<p>That's quite a lot of code to represent a name. But is it sufficient? Of course not! There are obvious things -- probably China isn't the only country where the surname is written before the firstname. So maybe the formatters should have less specific names, like &quot;FirstnameFirstFormatter&quot;, &quot;LastnameFirstFormatter&quot;. We actually should probably use the term &quot;Given name&quot; , as the &quot;Firstname&quot; certainly isn't &quot;first&quot; here.\nThere is also the issue of people who don't want to be called by the name that is defined in their documents. Some of them are transgender, some just are not used to being called that and there are probably more reasons, that I haven't even thought of. In some cases it is okay to just store preferred name, but sometimes (e.g. when processing card transactions) the official name is required. So let's define a <code>Person<\/code> class and see how it goes:<\/p>\n<pre><code class=\"language-csharp\">\tclass Person\n\t{\n\t\tIPersonalName OfficialName { get; set; }\n\t\tIPersonalName PrefferedName { get; set; }\n\t}\n<\/code><\/pre>\n<p>The interesting fact is that the preffered name and official name doesn't have to be of the same kind. I know a lot of people who have polynymous official names, but go by a mononymous preffered name (that includes myself -- my official name is Paweł Łuczkiewicz, but people just call me agares, or Kudłaty).\nSo, is this model complete? I'm sure it's not. But I believe it's better than the usual &quot;first name, last name&quot;, that is used all over the internet. So, next time you have to model a person's name, please think about all those people who don't fit the &quot;95% of Western people&quot; case.<\/p>\n"}